I tried to run almost the same example as you, and the plan was fine

```hcl
resource "coralogix_alert" "rds_cpu_usage_warning" {
  name        = "RDS CPU usage per RDS host - Warning TF"
  description = "Terraform example"
  severity    = "Warning"
  enabled     = false

  notifications_group {
    notification {
      notify_on                   = "Triggered_and_resolved"
      email_recipients            = ["example@gmail.com"]
      retriggering_period_minutes = 1
    }
  }

  show_in_insights {
    retriggering_period_minutes = 1
    notify_on                   = "Triggered_and_resolved"
  }

  scheduling {
    time_zone = "UTC+2"
    time_frame {
      days_enabled = ["Monday", "Friday"]
      start_time   = "07:00"
      end_time     = "23:00"
    }
  }

  metric {
    promql {
      search_query = "avg_over_time((avg(amazonaws_com_AWS_RDS_CPUUtilization{}) by (DBInstanceIdentifier)) [5m])"
      condition {
        more_than                      = true
        threshold                      = 10
        sample_threshold_percentage    = 0
        time_window                    = "5Min"
        replace_missing_value_with_zero = true
      }
    }
  }
}
```
got 

```
  + resource "coralogix_alert" "rds_cpu_usage_warning" {
      + description = "Terraform example"
      + enabled     = false
      + id          = (known after apply)
      + name        = "RDS CPU usage per RDS host - Warning TF"
      + severity    = "Warning"

      + metric {

          + promql {
              + search_query = "avg_over_time((avg(amazonaws_com_AWS_RDS_CPUUtilization{}) by (DBInstanceIdentifier)) [5m])"

              + condition {
                  + more_than                       = true
                  + replace_missing_value_with_zero = true
                  + sample_threshold_percentage     = 0
                  + threshold                       = 10
                  + time_window                     = "5Min"

                  + manage_undetected_values {
                      + auto_retire_ratio                      = (known after apply)
                      + enable_triggering_on_undetected_values = (known after apply)
                    }
                }
            }
        }

      + notifications_group {
          + group_by_fields = []

          + notification {
              + email_recipients            = [
                  + "example@gmail.com",
                ]
              + notify_on                   = "Triggered_and_resolved"
              + retriggering_period_minutes = 1
            }
        }

      + scheduling {
          + time_zone = "UTC+2"

          + time_frame {
              + days_enabled = [
                  + "Friday",
                  + "Monday",
                ]
              + end_time     = "23:00"
              + start_time   = "07:00"
            }
        }

      + show_in_insights {
          + notify_on                   = "Triggered_and_resolved"
          + retriggering_period_minutes = 1
        }
    }

```